<?php

function get_place_array(){

  $place_array_kanto = array(
    '東京都23区' => array(
      '渋谷', '恵比寿', '表参道', '青山', '原宿', '中目黒', '池袋', '代官山', '新宿',  '秋葉原', '赤坂', '神田', '銀座', '上野',  '北千住',  '品川', '新橋', '六本木', '西麻布', '有楽町', '麻布十番', '錦糸町', '練馬駅', '神楽坂', '代々木上原','代々木', '自由が丘', '豊洲', '飯田橋', '中野', '日本橋', '三軒茶屋'
    ),
    '東京都23区外' => array(
      '吉祥寺', '立川', '聖蹟桜ヶ丘', '八王子', '町田',
    ),
    '神奈川県' => array(
      '横浜', '関内', '川崎',  '藤沢', 
    ),
    '埼玉県' => array(
      '大宮', '南越谷', '所沢',
    ),
    '千葉県' => array(
      '柏', '浦和', '千葉駅',
    ),
    '群馬県' => array(
      '高崎', 
    ),
    '栃木県' => array(
      '宇都宮',
    )
  );

  $place_array_hokkaido = array(
    '北海道' => array(
      '札幌',
    )
  );

  $place_array = array(
    '関東'      => $place_array_kanto,
    '北海道'    => $place_array_hokkaido,
  );

  return $place_array;
}